alexvegaUTN/TPO_2021/LPC845_Project_Demo/source/LPC845_Project_Demo.c
/*
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of NXP Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file    LPC845_Project_Demo.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "LPC845.h"
#include "fsl_debug_console.h"
#include "PR_Timer.h"
#include "PR_UART0.h"
#include "DR_UART0.h"

#define TICKS_1MS		(30000)
#define BLINKING_TIME	(60)

/* TODO: insert other include files here. */

/* TODO: insert other definitions and declarations here. */

enum {
	TIMER_LED_ID,
}timer_id_e;

void SysTick_Handler(void)
{
	//contador++;
	Timer_Discount();
}

void timerLed_Handler(uint32_t value)
{
/*	static volatile uint8_t estadoLed = STATE_LED_OFF;

	if (estadoLed) {
		LED_Verde_OFF();
		estadoLed = STATE_LED_OFF;
	} else {
		LED_Verde_ON();
		estadoLed = STATE_LED_ON;
	}*/

	//LED_Verde_Toggle();
	Timer_Start(TIMER_LED_ID, BLINKING_TIME, MSEG, timerLed_Handler);
}

/*
 * @brief   Application entry point.
 */
int main(void) {

    /* Init board hardware. */
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    //BOARD_InitBootPeripherals();

    UART0_Init(9600, USART0_8_Bits_Data, USART0_ParityDisabled, USART0_OneStopBit);

    SysTick_Config(TICKS_1MS);
    Timer_Start(TIMER_LED_ID, BLINKING_TIME, MSEG, timerLed_Handler);

#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    /* Init FSL debug console. */
    BOARD_InitDebugConsole();
#endif

    //PRINTF("Hello World\n");

    char message[] = "Testing Serial...";
    UART0_Send_Data(message, sizeof message - 1);

    /* Force the counter to be placed into memory. */
    volatile static int i = 0 ;
    /* Enter an infinite loop, just incrementing a counter. */
    while(1) {

    	Timer_Event();
    	UART0_Analizar_Trama();

        i++ ;
        /* 'Dummy' NOP to allow source level single stepping of
            tight while() loop */
        __asm volatile ("nop");
    }
    return 0 ;
}
